/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[PlayerInputComponent.cpp] プレイヤーの入力コンポーネント
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：プレイヤーの入力コンポーネントの処理を定義
=============================================================================*/

/*--- インクルードファイル ---*/
#include "../../../StdAfx.h"
#include "PlayerInputComponent.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
PlayerInputComponent::PlayerInputComponent(GameObject* owner, int updateOrder)
	: InputComponent(owner, updateOrder)
{
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
PlayerInputComponent::~PlayerInputComponent(void)
{
}

void PlayerInputComponent::Init(void)
{
}

void PlayerInputComponent::Uninit(void)
{
}

void PlayerInputComponent::Input(void)
{
}

void PlayerInputComponent::Update(float deltaTime)
{
}

/*=============================================================================
/*		End of File
=============================================================================*/