/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[EnemyAIComponent.cpp] 敵AIのコンポーネント
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：敵AIコンポーネントの処理を定義
=============================================================================*/

/*--- インクルードファイル ---*/
#include "../../../../../StdAfx.h"
#include "EnemyAIComponent.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
EnemyAIComponent::EnemyAIComponent(GameObject* owner, int updateOrder)
	: AIComponent(owner, updateOrder)
	, enemy_state_(EnemyState::None)
	, motion_state_(EnemyMotionState::None)
	, max_hit_point_(0.f)
	, hit_point_(0.f)
{
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
EnemyAIComponent::~EnemyAIComponent(void)
{
}

/*-----------------------------------------------------------------------------
/* 待機行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::Idle(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 登場行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::Enter(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 体当たり行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::BodyPress(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 射撃攻撃行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::Shoot(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* レーザー砲攻撃行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::LaserCannon(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 直線移動行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveStraight(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 直線移動して一回待つ行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveStraightWaitOneTime(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 直線移動して上下運動して一回待つ
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveStraightWaitUpDown(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 垂直に半円を描く移動行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveRoundVertical(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 水平に半円を描く移動行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveRoundHorizontal(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 上下ループ移動行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveLoopUpDown(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 左右ループ移動行動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveLoopLeftRight(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* 画面の端からひょっこり顔をだす
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveShowOneTime(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* S字カーブで移動
-----------------------------------------------------------------------------*/
void EnemyAIComponent::MoveSShapedCurve(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*=============================================================================
/*		End of File
=============================================================================*/