/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[DevelopSystemDefine.h] 開発システム定義ヘッダ
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：開発するにあたって、現在状況では無駄な処理を省くように指定する
=============================================================================*/
#ifndef DEVELOP_SYSTEM_DEFINE_H_
#define	DEVELOP_SYSTEM_DEFINE_H_

/*--- インクルードファイル ---*/

//この定義をコメント化するかしないかで処理を省くように指定する。
#define IN_DEVELOPMENT_ 

//テストコード
#if defined(IN_DEVELOPMENT_)
	//Enable;
#else
	//Disable;
#endif // defined(IN_DEVELOPMENT_)


#endif //DEVELOP_SYSTEM_DEFINE_H_
/*=============================================================================
/*		End of File
=============================================================================*/