/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Main.cpp] メインモジュール
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：メインで実行する処理の流れを定義
=============================================================================*/

/*--- インクルードファイル ---*/
#include "StdAfx.h"
#include "Application.h"

/*-----------------------------------------------------------------------------
/* メイン処理
-----------------------------------------------------------------------------*/
int APIENTRY WinMain(_In_ HINSTANCE hInstance, _In_opt_  HINSTANCE hPrevInstance, _In_ LPSTR lpCmdLine, _In_ int nShowCmd)
{
	UNREFERENCED_PARAMETER(hPrevInstance);
	UNREFERENCED_PARAMETER(lpCmdLine);

	//メモリリーク検知用
#if defined(_DEBUG) || defined(DEBUG) //下記の関数はリリースビルド時に実行されないらしいけれど、一応設定しておく
	_CrtSetDbgFlag(_CRTDBG_ALLOC_MEM_DF | _CRTDBG_LEAK_CHECK_DF);
#endif

	/*----------------------------------------------
	/* メインの実行命令
	----------------------------------------------*/
	{
		Application app;
		bool is_success = app.StartUp(hInstance, nShowCmd);
		if (is_success)
		{
			app.Run();				
		}
		app.ShutDown();					
	}
	return 0;
}

/*=============================================================================
/*		End of File
=============================================================================*/