/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[IManager.h] 管理クラスのインターフェースクラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：管理クラスのインターフェースクラス
=============================================================================*/
#ifndef IMANAGER_H_
#define	IMANAGER_H_

/*--- インクルードファイル ---*/

/*-------------------------------------
/* 構造体
-------------------------------------*/

/*-------------------------------------
/*  管理クラスのインターフェース
-------------------------------------*/
class IManager
{
public:
	IManager(void){}
	virtual ~IManager(void){}

	virtual bool Init(void) = 0;
	virtual void Uninit(void) = 0;
	virtual void Input(void) = 0;
	virtual void Update(float deltaTime) = 0;
	virtual void GenerateOutput(void) = 0;

private:
};


#endif //IMANAGER_H_
/*=============================================================================
/*		End of File
=============================================================================*/