/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[SphereColliderComponent.cpp] スフィアコライダのコンポーネント
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：スフィアコライダのコンポーネント
=============================================================================*/

/*--- インクルードファイル ---*/
#include "../../../../../StdAfx.h"
#include "SphereColliderComponent.h"
#include "../../GameObject.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
SphereColliderComponent::SphereColliderComponent(GameObject* owner, int updateOrder)
	: ColliderComponent(owner, updateOrder)
	, position_(0.f, 0.f, 0.f)
	, radius_(0.5f)
{
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
SphereColliderComponent::~SphereColliderComponent(void)
{
}

/*-----------------------------------------------------------------------------
/* 更新処理
-----------------------------------------------------------------------------*/
void SphereColliderComponent::Update(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);

	// 衝突判定の位置情報の更新
	position_ = *owner_->GetTransform()->GetPosition();
}

/*=============================================================================
/*		End of File
=============================================================================*/