/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Manager.h] 全体の処理の管理クラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：全体の処理の管理クラス
=============================================================================*/
#ifndef MANAGER_H_
#define	MANAGER_H_

/*--- インクルードファイル ---*/

/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/


/*-------------------------------------
/* 全体の処理の管理クラス
-------------------------------------*/
class Manager
{
public:
	Manager(void);
	~Manager(void);

	static Manager* Create(void);

	void InitAll(void);
	void UninitAll(void);
	void InputAll(void);
	void UpdateAll(float deltaTime);
	void GenerateOutputAll(void);

private:
};


#endif //MANAGER_H_
/*=============================================================================
/*		End of File
=============================================================================*/