/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Fade.cpp] ゲーム画面のFadeクラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：ゲーム画面のFadeの挙動を定義したクラス
=============================================================================*/

/*--- インクルードファイル ---*/
#include "../../../../../StdAfx.h"
#include "Fade.h"
#include "../../Component/RendererComponent/SpriteRendererComponent.h"
#include "../../../Game.h"

#include "../../../../ImGui/ImGuiManager.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
Fade::Fade(class Game* game)
	: UI(game)
{
	this->Init();
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
Fade::~Fade(void)
{
	this->Uninit();
}

/*-----------------------------------------------------------------------------
/* 初期化処理
-----------------------------------------------------------------------------*/
bool Fade::Init(void)
{
	// フェードの生成
	fade_ = NEW SpriteRendererComponent(this, 300);
	fade_->SetVertexColor(0, 0, 0);
	return true;
}

/*-----------------------------------------------------------------------------
/* 終了化処理
-----------------------------------------------------------------------------*/
void Fade::Uninit(void)
{
}

/*-----------------------------------------------------------------------------
/* 入力処理
-----------------------------------------------------------------------------*/
void Fade::InputGameObject(void)
{
}

/*-----------------------------------------------------------------------------
/* 更新処理
-----------------------------------------------------------------------------*/
void Fade::UpdateGameObject(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);

	float screen_width  = game_->GetGraphics()->GetScreenSize().x_;
	float screen_height = game_->GetGraphics()->GetScreenSize().y_;

	// フェードの画面サイズの設定
	fade_->SetScaleX(screen_width);
	fade_->SetScaleY(screen_height);
	
	static int fade_value = 0;

	ImGui::Begin("Fade");
	ImGui::SliderInt("##fade", &fade_value, 0, 255);
	ImGui::End();

	// フェードの値を設定
	fade_->SetVertexColor(0, 0, 0, fade_value);
}

/*=============================================================================
/*		End of File
=============================================================================*/