/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Title.h] タイトル画面クラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：タイトル画面の挙動を定義したクラス
=============================================================================*/
#ifndef TITLE_H_
#define	TITLE_H_

/*--- インクルードファイル ---*/
#include "../UI.h"

/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/


/*-------------------------------------
/* タイトル画面クラス
-------------------------------------*/
class Title : public UI
{
public:
	Title(class Game* game);
	~Title(void);

	void Init(void);
	void Uninit(void);
	void Input(void);
	void Update(float deltaTime);
	void Draw(void);

	virtual TypeID GetType(void) const { return TypeID::Title; } 

private:

};


#endif //TITLE_H_
/*=============================================================================
/*		End of File
=============================================================================*/