/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Actor.cpp] アクターゲームオブジェクト
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：アクターゲームオブジェクト
=============================================================================*/

/*--- インクルードファイル ---*/
#include "../../../../../StdAfx.h"
#include "Actor.h"
#include "../../../SandBoxManager/ActorManager.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
Actor::Actor(Game* game)
	: SandBox(game)
	, max_hit_point_(0.f)
	, hit_point_(0.f)
	, hit_point_old_(0.f)
	, max_attack_(0.f)
	, attack_(0.f)
	, is_destroy_(false)
	, destroy_interval_time_(0.f)
	, game_manager_(nullptr)
	, actor_mesh_(nullptr)
	, explosion_effect_(nullptr)
	, sphere_collider_(nullptr)
	, sphere_gizmo_(nullptr)
	, obb_collider_(nullptr)
	, obb_collider_gizmo_(nullptr)
{
	renderer_layer_type_ = RendererLayerType::Game;

	// 初期化
	this->Init();

	// アクターマネージャにインスタンスのアドレスを追加
	game_->GetActorManager()->AddActorGameObjectAddress(this);
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
Actor::~Actor(void)
{
	// 終了化
	this->Uninit();

	// アクターマネージャのインスタンスのアドレスを削除
	game_->GetActorManager()->RemoveActorGameObjectAddress(this);
}

/*-----------------------------------------------------------------------------
/* 初期化処理
-----------------------------------------------------------------------------*/
bool Actor::Init(void)
{
	// ステータスの初期化
	{
		max_hit_point_  = 100.f;
		hit_point_		= 100.f;
		hit_point_old_  = hit_point_;
		max_attack_		= 1.f;
		attack_			= 1.f;
	}
	return true;
}

/*-----------------------------------------------------------------------------
/* 終了化処理
-----------------------------------------------------------------------------*/
void Actor::Uninit(void)
{
}

/*-----------------------------------------------------------------------------
/* 入力処理
-----------------------------------------------------------------------------*/
void Actor::InputGameObject(void)
{
}

/*-----------------------------------------------------------------------------
/* 更新処理
-----------------------------------------------------------------------------*/
void Actor::UpdateGameObject(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*=============================================================================
/*		End of File
=============================================================================*/