/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[EnemyFactoryState.h] エネミーファクトリの状態クラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：エネミーファクトリの状態クラス
=============================================================================*/
#ifndef ENEMY_FACTORY_STATE_H_
#define	ENEMY_FACTORY_STATE_H_

/*--- インクルードファイル ---*/


/*-------------------------------------
/* エネミーファクトリの状態クラス
-------------------------------------*/
class EnemyFactoryState
{
public:
	EnemyFactoryState(class Game* game)
		:game_(game)
	{}
	virtual ~EnemyFactoryState(void) {}

	virtual bool Init(void) = 0;
	virtual void Uninit(void) = 0;

protected:
	class Game* game_;
};


#endif //ENEMY_FACTORY_STATE_H_
/*=============================================================================
/*		End of File
=============================================================================*/