/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[EnemyFactory.h] エネミーのファクトリクラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：エネミーのファクトリクラス
=============================================================================*/
#ifndef ENEMY_FACTORY_H_
#define	ENEMY_FACTORY_H_

/*--- インクルードファイル ---*/

/*-------------------------------------
/* エネミーのファクトリクラス
-------------------------------------*/
class EnemyFactory
{
public:
	EnemyFactory(class Game* game);
	~EnemyFactory(void);

	bool Init(void);
	void Uninit(void);
	void Input(void);
	void Update(float deltaTime);

private:
	class Game* game_;
};

#endif //ENEMY_FACTORY_H_
/*=============================================================================
/*		End of File
=============================================================================*/