/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[BulletManager.cpp] アクター管理クラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：アクター管理クラス
=============================================================================*/

/*--- インクルードファイル ---*/
#include "../../../StdAfx.h"
#include "BulletManager.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
BulletManager::BulletManager(Game* game)
	: game_(game)
{
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
BulletManager::~BulletManager(void)
{
}

/*-----------------------------------------------------------------------------
/* ファクトリメソッド
-----------------------------------------------------------------------------*/
BulletManager* BulletManager::Create(Game* game)
{
	return NEW BulletManager(game);
}

/*-----------------------------------------------------------------------------
/* 起動処理
-----------------------------------------------------------------------------*/
bool BulletManager::StartUp(void)
{
	//自身の初期化
	const bool bullet_manager_init = this->Init();
	if (bullet_manager_init == false)
	{
		assert(!"BulletManager::StartUp()：バレットマネージャの初期化に失敗しました。");
		return false;
	}
	return true;
}

/*-----------------------------------------------------------------------------
/* 停止処理
-----------------------------------------------------------------------------*/
void BulletManager::Shutdown(void)
{
	this->Uninit();
}

/*-----------------------------------------------------------------------------
/* 初期化処理
-----------------------------------------------------------------------------*/
bool BulletManager::Init(void)
{
	//自身の初期化
	{
		bullet_list_.clear();
	}
	return true;
}

/*-----------------------------------------------------------------------------
/* 終了化処理
-----------------------------------------------------------------------------*/
void BulletManager::Uninit(void)
{
}

/*-----------------------------------------------------------------------------
/* アクターゲームオブジェクトのアドレスの追加処理
-----------------------------------------------------------------------------*/
void BulletManager::AddBulletGameObjectAddress(Bullet* bullet)
{
	bullet_list_.emplace_back(bullet);
}

/*-----------------------------------------------------------------------------
/* アクターゲームオブジェクトのアドレスの削除処理
-----------------------------------------------------------------------------*/
void BulletManager::RemoveBulletGameObjectAddress(Bullet* bullet)
{
	auto iter = std::find(bullet_list_.begin()	//範囲0～
						 , bullet_list_.end()	//範囲最大まで
						 , bullet);				//探す対象

	if (iter != bullet_list_.end())
	{
		bullet_list_.erase(iter);
	}
}

/*-----------------------------------------------------------------------------
/* アクターゲームオブジェクトのアドレスを検索処理
-----------------------------------------------------------------------------*/
Bullet* BulletManager::FindBulletGameObjectAddress(Bullet* bullet)
{
	auto iter = std::find(bullet_list_.begin()	//範囲0～
						 , bullet_list_.end()	//範囲最大まで
						 , bullet);				//探す対象

	// 見つかった場合
	if (iter != bullet_list_.end())
	{
		// コンテナの中のインデックスを取得
		const int iter_index = std::distance(bullet_list_.begin(), iter);
		return bullet_list_.at(iter_index);
	}

	// 見つからなかった場合
	assert(!"BulletManager::FindBulletGameObjectAddress():バレットが見つかりませんでした！");
	return nullptr;
}

/*=============================================================================
/*		End of File
=============================================================================*/