/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[AIComponent.h] AIビヘイビアのベースコンポーネント
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：AIビヘイビアコンポーネントのベースになるクラス定義
=============================================================================*/
#ifndef AI_COMPONENT_H_
#define	AI_COMPONENT_H_

/*--- インクルードファイル ---*/
#include "../Component.h"

/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/


/*-------------------------------------
/* AIビヘイビアコンポーネントのベースクラス
-------------------------------------*/
class AIComponent : public Component
{
public:
	AIComponent(class GameObject* owner, int updateOrder = 100);
	~AIComponent(void);

	virtual TypeID GetComponentType() const override { return TypeID::AIComponent; };

private:
protected:
};

#endif //AI_COMPONENT_H_
/*=============================================================================
/*		End of File
=============================================================================*/