/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[ColliderComponent.cpp] コライダコンポーネントのベースコンポーネント
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：コライダコンポーネントに共通する処理の定義
=============================================================================*/

/*--- インクルードファイル ---*/
#include "../../../../StdAfx.h"
#include "ColliderComponent.h"
#include "../GameObject.h"
#include "../../Game.h"
#include "../../Manager/ColliderManager.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
ColliderComponent::ColliderComponent(GameObject* owner, int updateOrder)
	: Component(owner, updateOrder)
{
	owner_->GetGame()->GetColliderManager()->AddColliderComponentAddress(this);
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
ColliderComponent::~ColliderComponent(void)
{
	owner_->GetGame()->GetColliderManager()->RemoveColliderComponentAddress(this);
}

/*=============================================================================
/*		End of File
=============================================================================*/