/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[Camera.cpp] カメラクラス
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：カメラクラス
=============================================================================*/

/*--- インクルードファイル ---*/
#include "../../../../StdAfx.h"
#include "Camera.h"
#include "../../../Math.h"
#include "../Component/CameraComponent.h"
#include "../../Renderer.h"

#include "../../Input/InputCheck.h"
#include "../../../ImGui/ImGuiManager.h"

/*-----------------------------------------------------------------------------
/* コンストラクタ
-----------------------------------------------------------------------------*/
Camera::Camera(class Game* game)
	: GameObject(game)
	, game_(game)
	, is_moved_(false)
{
	this->renderer_layer_type_ = RendererLayerType::Game;

	this->Init();

	game_->GetRenderer()->AddCameraGameObjectAddress(this);
}

/*-----------------------------------------------------------------------------
/* デストラクタ
-----------------------------------------------------------------------------*/
Camera::~Camera(void)
{
	game_->GetRenderer()->RemoveCameraGameObjectAddress(this);
}

/*-----------------------------------------------------------------------------
/* 初期化処理
-----------------------------------------------------------------------------*/
bool Camera::Init(void)
{
	camera_component_ = NEW CameraComponent(this);

	// カメラ座標の初期化
	{
		camera_component_->SetLookAtTranslation(0.f, 0.f, 1.f);
		camera_component_->SetCameraTranslation(0.f, 0.f, 0.f);
	}

	// カメラの状態を初期化
#ifdef CAMERA_DEBUG_MODE_
	camera_component_->IsSetCameraControlling(true); // カメラ操作の状態を初期化
#endif // CAMERA_DEBUG_MODE_
	return true;
}

/*-----------------------------------------------------------------------------
/* 終了化処理
-----------------------------------------------------------------------------*/
void Camera::Uninit(void)
{
}

/*-----------------------------------------------------------------------------
/* ゲームオブジェクトの入力処理
-----------------------------------------------------------------------------*/
void Camera::InputGameObject(void)
{
}

/*-----------------------------------------------------------------------------
/* ゲームオブジェクトの更新処理
-----------------------------------------------------------------------------*/
void Camera::UpdateGameObject(float deltaTime)
{
	UNREFERENCED_PARAMETER(deltaTime);
}

/*-----------------------------------------------------------------------------
/* ビュー行列の取得
-----------------------------------------------------------------------------*/
D3DXMATRIX* Camera::GetViewMatrix(void)
{
	return camera_component_->GetViewMatrix();
}

/*-----------------------------------------------------------------------------
/* 逆ビュー行列の取得
-----------------------------------------------------------------------------*/
D3DXMATRIX* Camera::GetViewInverseMatrix(void)
{
	return camera_component_->GetViewInverseMatrix();
}

/*-----------------------------------------------------------------------------
/* 2Dプロジェクション行列の取得
-----------------------------------------------------------------------------*/
D3DXMATRIX* Camera::GetProjection2DMatrix(void)
{
	return camera_component_->GetProjection2DMatrix();
}

/*-----------------------------------------------------------------------------
/* 3Dプロジェクション行列の取得
-----------------------------------------------------------------------------*/
D3DXMATRIX* Camera::GetProjection3DMatrix(void)
{
	return camera_component_->GetProjection3DMatrix();
}

/*-----------------------------------------------------------------------------
/* カメラが移動したかのフラグ
-----------------------------------------------------------------------------*/
bool Camera::IsGetCameraMoved(void) const
{
	return camera_component_->IsGetCameraMoved();
}

/*=============================================================================
/*		End of File
=============================================================================*/