/*=============================================================================
/*-----------------------------------------------------------------------------
/*	[RenderComponent.h] 入力コンポーネントのベースコンポーネント
/*	Author：Kousuke,Ohno.
/*-----------------------------------------------------------------------------
/*	説明：入力コンポーネントのコンポーネントのベースになるクラス定義
=============================================================================*/
#ifndef RENDER_COMPONENT_H_
#define	RENDER_COMPONENT_H_

/*--- インクルードファイル ---*/
#include "../Component.h"

/*--- 構造体定義 ---*/

/*--- クラスの前方宣言 ---*/


/*-------------------------------------
/* 入力コンポーネントのベースクラス
-------------------------------------*/
class RenderComponent : public Component
{
public:
	RenderComponent(class GameObject* owner, int drawOrder = 100);
	~RenderComponent(void);

	TypeID GetComponentType(void) const override { return TypeID::RenderComponent; }

private:
protected:
};


#endif //RENDER_COMPONENT_H_
/*=============================================================================
/*		End of File
=============================================================================*/